// Ввести возраст пассажира, признак действительного документа и массу багажа. Если документ недействителен, регистрация запрещена независимо от остальных данных. Если документ действителен, пассажир младше 16 лет может зарегистрироваться только при признаке сопровождения 1 (введите его отдельно). Багаж свыше 50 кг не принимается, но регистрация пассажира при этом возможна. Вывести отдельные решения по пассажиру и багажу.

//

#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");

    int age;          
    int dokument;         
    int accompanying;   
    double mass;         

    cout << "Введите возраст пассажира: ";
    cin >> age;

    cout << "Документ действителен? (1 - да, 0 - нет): ";
    cin >> dokument;

    cout << "Введите массу багажа: ";
    cin >> mass;

    cout << "Есть сопровождение? (1 - да, 0 - нет): ";
    cin >> accompanying;

    cout << "\n--- Решение по пассажиру ---" << endl;

   
    if (dokument == 0) {
        cout << "Регистрация запрещена: документ недействителен." << endl;
    }
    else {
        
        if (age < 16) {
            
            if (accompanying == 1) {
                cout << "Регистрация разрешена (есть сопровождение)." << endl;
            }
            else {
                cout << "Регистрация запрещена: нет сопровождения." << endl;
            }
        }
        else {
            
            cout << "Регистрация разрешена." << endl;
        }
    }

    cout << "\n--- Решение по багажу ---" << endl;

    
    if (mass > 50) {
        cout << "Багаж не принимается (вес больше 50 кг)." << endl;
    }
    else {
        cout << "Багаж принимается." << endl;
    }

    return 0;
}