//  Ввести массу багажа и бесплатную норму. Оба значения должны быть неотрицательными, норма — положительной. Если масса не превышает норму, доплата 0. Иначе каждый килограмм перевеса стоит 5. Если масса превышает 50 кг, багаж не принимается и стоимость перевеса не рассчитывается. Вывести решение.

//

#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian"); 

    double mass;     
    int norm;    
    double extra;   

    cout << "Введите массу багажа: ";
    cin >> mass;

    cout << "Введите бесплатную норму: ";
    cin >> norm;

   
    if (mass < 0 || norm <= 0) {
        cout << "Ошибка: масса должна быть >= 0, норма > 0" << endl;
        return 0;
    }

    
    if (mass > 50) {
        cout << "Багаж не принимается (вес больше 50 кг)" << endl;
        cout << "Стоимость перевеса не рассчитывается" << endl;
    }
    else {
       
        if (mass <= norm) {
            extra = 0;
            cout << "Доплата: " << extra << " руб." << endl;
        }
        else {
           
            extra = (mass - norm) * 5;
            cout << "Доплата: " << extra << " руб." << endl;
        }
    }

    return 0;
}
